---
kind: enumMember
id: F:Autodesk.Revit.DB.Fabrication.DesignToFabricationConverterResult.PartialFailure
enum: Autodesk.Revit.DB.Fabrication.DesignToFabricationConverterResult
source: html/e2792594-c085-0582-9ff8-3eb8ea726bdc.htm
---
# Autodesk.Revit.DB.Fabrication.DesignToFabricationConverterResult.PartialFailure

Conversion contained partial failures and will need to be fixed manually.